In [1]:
%load_ext sql
%reload_ext sql
%sql sqlite://

In [3]:
%%sql
CREATE TABLE employees (
    emp_id INT PRIMARY KEY ,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    salary INT);

 * sqlite://
Done.

[]

In [4]:
%%sql
INSERT INTO employees VALUES
(1,'Luke','Skywalker',100),
(2,'Anakin','Skywalker',200),
(3,'Liea','Skywalker',50),
(4,'Rey','Skywalker',150),
(5,'Han','Solo',100),
(6,'Darth','Vader',150);

 * sqlite://
6 rows affected.

[]

#### Q-19. Write an SQL query to determine the 5th highest salary without using TOP or limitmethod.

In [11]:
%%sql
SELECT * FROM (SELECT ROW_NUMBER() OVER (ORDER BY salary DESC) AS R_NUM, first_name, salary FROM employees) as HEllO WHERE R_NUM=5;

 * sqlite://
Done.

[(5, 'Han', 100)]

#### Q-20. Write an SQL query to fetch the list of employees with the same salary.

In [9]:
%%sql
SELECT * FROM employees ORDER BY salary ASC;

 * sqlite://
Done.

[(3, 'Liea', 'Skywalker', 50),
 (1, 'Luke', 'Skywalker', 100),
 (5, 'Han', 'Solo', 100),
 (4, 'Rey', 'Skywalker', 150),
 (6, 'Darth', 'Vader', 150),
 (2, 'Anakin', 'Skywalker', 200)]